# Parameters
#通道数
ch: 6
nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
#  n: [0.50, 0.25, 1024]
#  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
#  l: [1.00, 1.00, 512]
#  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
#  [ 输入来自哪一层, 模块重复次数, 模块名称, 模块参数 ]
  - [-1, 1, IdentityInput, []] # 0 层0: 占位符，接收 6 通道输入
  - [-1, 1, ModalitySelector, [1]] # 1 RGB 从层0取数据，切分出第1个模态 (RGB)
  - [-2, 1, ModalitySelector, [2]] # 2 SAR  从层0 (即-2) 取数据，切分出第2个模态 (SARR)

  # YOLO-Fuse backbone
  # Visible branch
  - [1, 1, Conv, [32, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 5

  # Infrared branch
  - [2, 1, Conv, [32, 3, 2]] # 6-P1/2
  - [-1, 1, Conv, [64, 3, 2]] # 7-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] #8

  - [5, 1, Conv, [128, 3, 2]] # 9-P3/8 #rgb
  - [8, 1, Conv, [128, 3, 2]] # 10-P3/8  # SAR

  - [9, 2, C3k2, [256, False, 0.25]] # 11 rgb
  - [10, 2, C3k2, [256, False, 0.25]] # 12 sar

  # TwoFreDS是交互后重新增强
#  - [[11, 12], 1, TwoFreDS, [256]]    # 13
#  - [13, 1, ModalitySelector, [1]]    # 14: 提取增强后的 RGB (用于 P4)
#  - [13, 1, ModalitySelector, [2]]    # 15: 提取增强后的 SAR (用于 P4)

  - [[9, 10], 1, Fusion_Module, [1]]  #  13

  - [ 11, 1, Conv, [256, 3, 2]] # RGB-Down 14
  - [ 12, 1, Conv, [256, 3, 2]] # SAR-Down 15
  - [ 14, 2, C3k2, [256, True]] # RGB-P4-Feat 16
  - [ 15, 2, C3k2, [256, True]] # SAR-P4-Feat 17

  - [[16, 17], 1, TwoFreDS, [256]]  # 18
  - [ 18, 1, ModalitySelector, [1]]    #  提取增强后的 RGB (用于 P5) 19
  - [ 18, 1, ModalitySelector, [2]]    #  提取增强后的 SAR (用于 P5) 20

  - [[19, 20], 1, Fusion_Module, [1]]  # 21

  # --- P5 阶段 (下采样到 128) ---
  - [ 19, 1, Conv, [512, 3, 2]] # RGB-P5-Down 22
  - [ 20, 1, Conv, [512, 3, 2]] # SAR-P5-Down 23

  # --- P5 特征提取 (保持 128) ---
  - [ 22, 2, C3k2, [512, True]] # RGB-P5-Feat 24
  - [ 24, 1, SPPF, [512, 5]]    #  25
  - [ 25, 2, C2PSA, [512]]      #  26

  - [ 23, 2, C3k2, [512, True]] # SAR-P5-Feat 27
  - [ 27, 1, SPPF, [512, 5]]    # 28
  - [ 28, 2, C2PSA, [512]]      #  29

  - [[26, 29], 1, TwoFreDS, [512]]  # 30
  - [ 30, 1, ModalitySelector, [1]]    # 提取增强后的 RGB (用于 P5) 31
  - [ 30, 1, ModalitySelector, [2]]    #  提取增强后的 SAR (用于 P5) 32
  - [[31, 32], 1, Fusion_Module, [1]] #  融合 P5 33

# YOLO-Fuse head
head: # fusion
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 上采样 34
  - [[-1, 21], 1, Concat, [1]] #  cat backbone P4 35
  - [-1, 2, C3k2, [256, False]] #  36

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 37
  - [[-1, 13], 1, Concat, [1]] # 38 cat backbone P3
  - [-1, 2, C3k2, [128, False]] # 39 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]] # 40
  - [[-1, 36], 1, Concat, [1]] # 41 cat head P4
  - [-1, 2, C3k2, [256, False]] # 42 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]] # 43
  - [[-1, 33], 1, Concat, [1]] # 44 cat head P5
  - [-1, 2, C3k2, [512, True]] # 45 (P5/32-large)
    # opt
  - [ 29, 1, nn.Upsample, [ None, 2, "nearest" ] ] # 46 上采样
  - [ [ -1, 19 ], 1, Concat, [ 1 ] ] # 47 cat backbone P4
  - [ -1, 2, C3k2, [ 256, False ] ] # 48

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ] # 49
  - [ [ -1, 11 ], 1, Concat, [ 1 ] ] # 50 cat backbone P3
  - [ -1, 2, C3k2, [ 128, False ] ] # 51 (P3/8-small)

  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 52
  - [ [ -1,48], 1, Concat, [ 1 ] ] # 53 cat head P4
  - [ -1, 2, C3k2, [ 256, False ] ] # 54 (P4/16-medium)

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 55
  - [ [ -1, 26 ], 1, Concat, [ 1 ] ] # 56 cat head P5
  - [ -1, 2, C3k2, [ 512, True ] ] # 57 (P5/32-large)
    # sar
  - [ 32, 1, nn.Upsample, [ None, 2, "nearest" ] ] # 58 上采样
  - [ [ -1, 20 ], 1, Concat, [ 1 ] ] # 59 cat backbone P4
  - [ -1, 2, C3k2, [ 256, False ] ] # 60

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ] # 61
  - [ [ -1, 12 ], 1, Concat, [ 1 ] ] # 62 cat backbone P3
  - [ -1, 2, C3k2, [ 128, False ] ] # 63 (P3/8-small)

  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 64
  - [ [ -1, 60], 1, Concat, [ 1 ] ] # 65 cat head P4
  - [ -1, 2, C3k2, [ 256, False ] ] # 66 (P4/16-medium)

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 67
  - [ [ -1, 29 ], 1, Concat, [ 1 ] ] # 68 cat head P5
  - [ -1, 2, C3k2, [ 512, True ] ] # 69 (P5/32-large)

#  - [[39, 42, 45, 51, 54, 57, 63, 66, 69], 1, MultiDetect, [nc]] # Detect(P3, P4, P5)
  - [[39, 42, 45, 51, 54, 57, 63, 66, 69], 1, MultiOBBDetect, [nc]] # Detect(P3, P4, P5)
