# maienet_yolo11m.yaml

ch: 6
nc: 3

scales:
#  n: [0.50, 0.25, 1024]
#  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
#  l: [1.00, 1.00, 512]
#  x: [1.00, 1.50, 512]

backbone:
  # 输入: [B,6,H,W]
  - [-1, 1, ChannelToBatchConcat, [6, 3, "sar_opt", "opt_sar"]]   # 0 → [2B,3]

  # [2B,3]
  - [-1, 1, Conv, [64, 3, 2]]              # 1
  - [-1, 1, Conv, [128, 3, 2]]             # 2
  - [-1, 2, C3k2, [256, False, 0.25]]      # 3

  # Stage2 + MF
  - [-1, 1, MF, [256]]                     # 4

  # Stage3
  - [-1, 1, Conv, [256, 3, 2]]             # 5
  - [-1, 2, C3k2, [512, False, 0.25]]      # 6

  # Stage4
  - [-1, 1, Conv, [512, 3, 2]]             # 7
  - [-1, 2, C3k2, [512, True]]             # 8

  # Stage5
  - [-1, 1, Conv, [1024, 3, 2]]            # 9
  - [-1, 2, C3k2, [1024, True]]            # 10
  - [-1, 1, SPPF, [1024, 5]]               # 11

  # PSA 移除（论文要求）
  # - [-1, 2, C2PSA, [1024]]

  # 融合分支
  # BSCC 不影响主干，只作为输出分支
  - [6, 1, BSCC, [512]]                    # 12  P3 fusion
  - [8, 1, BSCC, [512]]                    # 13  P4 fusion

  # MAIE
  - [11, 1, MAIE, [1024]]                  # 14  P5 fusion

head:
  #  P5 → P4
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 13], 1, Concat, [1]]                   # 16
  - [-1, 2, C3k2, [512, False]]                  # 17

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18
  - [[-1, 12], 1, Concat, [1]]                   # 19
  - [-1, 2, C3k2, [256, False]]                  # 20

  #  下采样回 P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 21
  - [[-1, 17], 1, Concat, [1]]                   # 22
  - [-1, 2, C3k2, [512, False]]                  # 23

  #  下采样回 P5
  - [-1, 1, Conv, [512, 3, 2]]                   # 24
  - [[-1, 14], 1, Concat, [1]]                   # 25
  - [-1, 2, C3k2, [1024, True]]                  # 26

  # Detect
  - [[20, 23, 26], 1, OBB, [nc]]